; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star3 - direction
	GroundStation7 - direction
	Star2 - direction
	GroundStation10 - direction
	Star5 - direction
	GroundStation9 - direction
	Star6 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation8 - direction
	Star0 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation9)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star6)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
)
(:goal (and
	(pointing satellite1 Phenomenon18)
	(have_image Phenomenon11 thermograph1)
	(have_image Star12 infrared0)
	(have_image Star13 infrared0)
	(have_image Star14 thermograph1)
	(have_image Planet15 thermograph1)
	(have_image Star16 infrared0)
	(have_image Star17 infrared0)
	(have_image Phenomenon18 thermograph1)
))

)

; plan
1. (turn_to satellite1 star4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star4)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 star12 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star12)
   goals met: 0 of 9
5. (take_image satellite1 star12 instrument3 infrared0)
   added: (have_image star12 infrared0)
   goals met: 1 of 9
6. (turn_to satellite1 planet15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet15)
   goals met: 1 of 9
7. (take_image satellite1 planet15 instrument3 thermograph1)
   added: (have_image planet15 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon11 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon11 instrument3 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 9
10. (turn_to satellite1 star13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star13)
   goals met: 3 of 9
11. (take_image satellite1 star13 instrument3 infrared0)
   added: (have_image star13 infrared0)
   goals met: 4 of 9
12. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 4 of 9
13. (take_image satellite1 star14 instrument3 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 5 of 9
14. (turn_to satellite1 star16 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star16)
   goals met: 5 of 9
15. (take_image satellite1 star16 instrument3 infrared0)
   added: (have_image star16 infrared0)
   goals met: 6 of 9
16. (turn_to satellite1 star17 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star17)
   goals met: 6 of 9
17. (take_image satellite1 star17 instrument3 infrared0)
   added: (have_image star17 infrared0)
   goals met: 7 of 9
18. (turn_to satellite1 phenomenon18 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 phenomenon18)
   goals met: 8 of 9
19. (take_image satellite1 phenomenon18 instrument3 thermograph1)
   added: (have_image phenomenon18 thermograph1)
   goals met: 9 of 9
